```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.default_github_labels_for_gpo_ca.github_issue_label.documentation will be updated in-place
  ~ resource "github_issue_label" "documentation" {
      ~ color       = "0075ca" -> "0366d6"
        id          = "gpo.ca:documentation"
        name        = "documentation"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_ca.github_issue_label.duplicate will be updated in-place
  ~ resource "github_issue_label" "duplicate" {
      ~ color       = "cfd3d7" -> "ffffff"
        id          = "gpo.ca:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_ca.github_issue_label.invalid will be updated in-place
  ~ resource "github_issue_label" "invalid" {
      ~ color       = "e4e669" -> "ffffff"
        id          = "gpo.ca:invalid"
        name        = "invalid"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_ca.github_issue_label.performance will be created
  + resource "github_issue_label" "performance" {
      + color       = "a2eeef"
      + description = "Improves performance of the site"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "performance"
      + repository  = "gpo.ca"
      + url         = (known after apply)
    }

  # module.default_github_labels_for_gpo_ca.github_issue_label.question will be updated in-place
  ~ resource "github_issue_label" "question" {
      ~ color       = "d876e3" -> "0366d6"
        id          = "gpo.ca:question"
        name        = "question"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_it.github_issue_label.documentation will be updated in-place
  ~ resource "github_issue_label" "documentation" {
      ~ color       = "0075ca" -> "0366d6"
        id          = "gpo-it:documentation"
        name        = "documentation"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_it.github_issue_label.duplicate will be updated in-place
  ~ resource "github_issue_label" "duplicate" {
      ~ color       = "cfd3d7" -> "ffffff"
        id          = "gpo-it:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_it.github_issue_label.invalid will be updated in-place
  ~ resource "github_issue_label" "invalid" {
      ~ color       = "e4e669" -> "ffffff"
        id          = "gpo-it:invalid"
        name        = "invalid"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_it.github_issue_label.performance will be created
  + resource "github_issue_label" "performance" {
      + color       = "a2eeef"
      + description = "Improves performance of the site"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "performance"
      + repository  = "gpo-it"
      + url         = (known after apply)
    }

  # module.default_github_labels_for_gpo_it.github_issue_label.question will be updated in-place
  ~ resource "github_issue_label" "question" {
      ~ color       = "d876e3" -> "0366d6"
        id          = "gpo-it:question"
        name        = "question"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_platform_configs.github_issue_label.documentation will be updated in-place
  ~ resource "github_issue_label" "documentation" {
      ~ color       = "0075ca" -> "0366d6"
        id          = "gpo-platform-configs:documentation"
        name        = "documentation"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_platform_configs.github_issue_label.duplicate will be updated in-place
  ~ resource "github_issue_label" "duplicate" {
      ~ color       = "cfd3d7" -> "ffffff"
        id          = "gpo-platform-configs:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_platform_configs.github_issue_label.invalid will be updated in-place
  ~ resource "github_issue_label" "invalid" {
      ~ color       = "e4e669" -> "ffffff"
        id          = "gpo-platform-configs:invalid"
        name        = "invalid"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_gpo_platform_configs.github_issue_label.performance will be created
  + resource "github_issue_label" "performance" {
      + color       = "a2eeef"
      + description = "Improves performance of the site"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "performance"
      + repository  = "gpo-platform-configs"
      + url         = (known after apply)
    }

  # module.default_github_labels_for_gpo_platform_configs.github_issue_label.question will be updated in-place
  ~ resource "github_issue_label" "question" {
      ~ color       = "d876e3" -> "0366d6"
        id          = "gpo-platform-configs:question"
        name        = "question"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_readme.github_issue_label.documentation will be updated in-place
  ~ resource "github_issue_label" "documentation" {
      ~ color       = "0075ca" -> "0366d6"
        id          = "readme:documentation"
        name        = "documentation"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_readme.github_issue_label.duplicate will be updated in-place
  ~ resource "github_issue_label" "duplicate" {
      ~ color       = "cfd3d7" -> "ffffff"
        id          = "readme:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_readme.github_issue_label.invalid will be updated in-place
  ~ resource "github_issue_label" "invalid" {
      ~ color       = "e4e669" -> "ffffff"
        id          = "readme:invalid"
        name        = "invalid"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_readme.github_issue_label.performance will be created
  + resource "github_issue_label" "performance" {
      + color       = "a2eeef"
      + description = "Improves performance of the site"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "performance"
      + repository  = "readme"
      + url         = (known after apply)
    }

  # module.default_github_labels_for_readme.github_issue_label.question will be updated in-place
  ~ resource "github_issue_label" "question" {
      ~ color       = "d876e3" -> "0366d6"
        id          = "readme:question"
        name        = "question"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.documentation will be updated in-place
  ~ resource "github_issue_label" "documentation" {
      ~ color       = "0075ca" -> "0366d6"
        id          = "secure.gpo.ca:documentation"
        name        = "documentation"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.duplicate will be updated in-place
  ~ resource "github_issue_label" "duplicate" {
      ~ color       = "cfd3d7" -> "ffffff"
        id          = "secure.gpo.ca:duplicate"
        name        = "duplicate"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.invalid will be updated in-place
  ~ resource "github_issue_label" "invalid" {
      ~ color       = "e4e669" -> "ffffff"
        id          = "secure.gpo.ca:invalid"
        name        = "invalid"
        # (4 unchanged attributes hidden)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.performance will be created
  + resource "github_issue_label" "performance" {
      + color       = "a2eeef"
      + description = "Improves performance of the site"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "performance"
      + repository  = "secure.gpo.ca"
      + url         = (known after apply)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.question will be updated in-place
  ~ resource "github_issue_label" "question" {
      ~ color       = "d876e3" -> "0366d6"
        id          = "secure.gpo.ca:question"
        name        = "question"
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 20 to change, 0 to destroy.

```